In [22]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                   index = pd.Index(['LA','SF'], name = 'city'),
                   columns = pd.Index(['A','B','C','D'], name = 'letter'))
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [4]:
 dframe_st = dframe1.stack()

In [5]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int64

In [6]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [7]:
dframe_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [8]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [9]:
ser1 = Series([0,1,2],index = ['Q','X','Y'])

ser2 = Series([4,5,6],index = ['X','Y','Z'])

In [11]:
dframe = pd.concat([ser1,ser2],keys = ['Alpha','Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [12]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [14]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [15]:
dframe = dframe.unstack()

pivot

In [49]:
import pandas.util.testing as tm; tm.N = 3
#Create a unpivoted function
def unpivot(frame):
    N,K = frame.shape
    
    data = {'value':frame.values.ravel('F'),
            'variable':np.asarray(frame.columns).repeat(N),
            'date':np.tile(np.asarray(frame.index),K)}
    #Return dataframe
    return DataFrame(data,columns = ['date','variable','value'])
#set the dataframe we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [50]:
dframe

         date variable     value
0  2000-01-03        A -0.114384
1  2000-01-04        A -0.456400
2  2000-01-05        A -0.310940
3  2000-01-03        B -1.559009
4  2000-01-04        B -1.144125
5  2000-01-05        B -1.170304
6  2000-01-03        C -0.133315
7  2000-01-04        C -0.020635
8  2000-01-05        C  0.838107
9  2000-01-03        D  0.136547
10 2000-01-04        D -0.994052
11 2000-01-05        D  0.339688

In [51]:
dframe_piv = dframe.pivot('variable','date','value')
dframe_piv

date      2000-01-03  2000-01-04  2000-01-05
variable
A          -0.114384   -0.456400   -0.310940
B          -1.559009   -1.144125   -1.170304
C          -0.133315   -0.020635    0.838107
D           0.136547   -0.994052    0.339688

In [52]:
dframe_piv = dframe.pivot('date','variable','value')
dframe_piv

variable           A         B         C         D
date
2000-01-03 -0.114384 -1.559009 -0.133315  0.136547
2000-01-04 -0.456400 -1.144125 -0.020635 -0.994052
2000-01-05 -0.310940 -1.170304  0.838107  0.339688

In [65]:
dframe1 = DataFrame({'key1':['A']*2+['B']*3,
                    'key2':[2,2,2,3,3]})
dframe1

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [66]:
dframe1.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [67]:
dframe1.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [68]:
dframe1.drop_duplicates(['key1'])

  key1  key2
0    A     2
2    B     2

In [77]:
dframe1.drop_duplicates(['key1'] ,keep = 'last')

  key1  key2
1    A     2
4    B     3